Modern_Analysis_1_L3.tex
% Created 2023-08-31 Thu 15:58
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jim Liu}
\date{\today}
\title{Modern Analysis 1 Lecture 3}
\hypersetup{
 pdfauthor={Jim Liu},
 pdftitle={Modern Analysis 1 Lecture 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Minimal}
\label{sec:orgf8b4ae5}
\begin{itemize}
\item \(\mathbb{D}\) B is an ordered set, say \(\alpha \in B\) is minimal iff \(\forall x \in B, (x \leq \alpha \Rightarrow x = \alpha)\).
\item Claim: Let B be the set of all upper bds for \(A \subseteq S\). For \(\alpha \in B\), the following are equivalent.
\begin{enumerate}
\item \(\alpha\) is minimal;
\item \(\forall x (x < \alpha \Rightarrow x \notin B)\) This is Rudins \(\mathbb{D}\) of least UB.
\end{enumerate}
\item Proof of the Claim:\\[0pt]
We want to show that \(x < \alpha \Rightarrow x \notin B\) is equivalent to \(\alpha\) is minimal, i.e. \(x < \alpha \Rightarrow x \notin B \equiv x \in B \Rightarrow (x \leq \alpha \Rightarrow x = \alpha)\) \\[0pt]
From right to left:\\[0pt]
\(x \in B \Rightarrow (x \leq \alpha \Rightarrow x = \alpha)\)
\(\equiv (x \in B\) \(\bigwedge\) \(x \leq \alpha) \Rightarrow x = \alpha\) \\[0pt]
\(\equiv (x \leq \alpha \bigwedge x \in B) \Rightarrow x = \alpha\)\\[0pt]
\(\equiv x \leq \alpha \Rightarrow (x \in B \Rightarrow x = \alpha)\)\\[0pt]
\(\equiv x \leq \alpha \Rightarrow (x \neq \alpha \Rightarrow x \notin B )\)\\[0pt]
\(\equiv x \leq \alpha \bigwedge x \neq \alpha \Rightarrow x \notin B\)\\[0pt]
\(\equiv x < \alpha \Rightarrow x \notin B\)
\end{itemize}

\section{Least vs Minimal}
\label{sec:org82a1b46}
\begin{itemize}
\item THM: Least \(\Rightarrow\) Minimal. In a total ordered set, Least \(\Leftrightarrow\) Minimal.
\begin{itemize}
\item \(\mathbb{M}\) For partially ordered set S, if \(s \in S\) is the least element, then it is also a minimal element. In a total order set S, if \(s \in S\) is a minimal element, then it is also a least element and vice versa.
\item \(\mathbb{M}\) For a poset, if there exists a least element, then it is unique. Set \(\{0, 0, 1\}\) is not a counterexample becaues according to the \(\mathbb{D}\) of set, ``In mathematics, a set is defined as a collection of \textbf{distinct}, well-defined objects forming a group.'', \(\{0, 0, 1\} \equiv \{0, 1\}\). Hence, the least element is still unique!
\item \(\mathbb{M}\) in a poset, minimal element may not unique. For example:\\[0pt]
\begin{verbatim}
    C1 C2 C3 C4 C5 C6
      \ | /    \ | /
       \|/      \|/
        B1      B2
         \     /
          \   /
           \ /
            A
\end{verbatim}
In this case, if we define set S s.t. S contains all sets above A. Then B1 and B2 are the minimal elements of set S. Here, \(A \leq B = A \subseteq B\).
\end{itemize}
\end{itemize}
\section{Compatibility}
\label{sec:orge2ba5ca}
\begin{itemize}
\item \(\mathbb{D}\) Let F be a field. The total strict order > on F is compatible iff \(\forall a,b,c \in F\),
\begin{enumerate}
\item \(a > b, c \Rightarrow a+c > b+c\)
\item \(a > 0, b > 0 \Rightarrow ab > 0\)
\end{enumerate}

\item Remarks
\begin{enumerate}
\item \(a > 0 \Rightarrow -a < 0\)\\[0pt]
Proof:\\[0pt]
\(a + (-a) > 0 + (-a) \Rightarrow 0 > -a \equiv -a < 0\)
\item \(a \neq 0 \Rightarrow a^{2} > 0\) \\[0pt]
Proof:\\[0pt]
\(a \neq 0 \Rightarrow a > 0 \bigvee a < 0\)\\[0pt]
\begin{itemize}
\item case 1: \(a > 0\). Replace b = a of the 2 in \(\mathbb{D}\), i.e. \(a > 0, a >0 \Rightarrow aa > 0 \equiv a^{2} > 0\)\\[0pt]
\item case 2: \(a < 0\). It implies that \(-a > 0\). Again, by replacing \(b = -a\) of the 2 in \(\mathbb{D}\), then 2 becomes \(-a > 0, -a >0 \Rightarrow (-a)(-a) >0\).\\[0pt]
But, \((-a)(-a) = a\cdot a\)\\[0pt]
Proof this ``But'':\\[0pt]
\begin{itemize}
\item Option 1:\\[0pt]
First, \(a(-a) + (-a)(-a) = (a + (-a))(-a) = 0(-a) = 0\). This implies that \((-a)(-a)\) is the additive inverse of \(a(-a)\).\\[0pt]
Second, \(a(-a) + aa = a(-a + a) = a\cdot 0 = 0 \Rightarrow a\cdot a\) is also the additive inverse of \(a(-a)\).\\[0pt]
But the additive inverse is unique.\\[0pt]
Thus, \((-a)(-a) = a\cdot a = a^{2}\)

\item Option 2:\\[0pt]
First, prove \((-1)a = -a\).\\[0pt]
\begin{itemize}
\item \(\mathbb{E}\) Prove the above statement.
\end{itemize}
Then, \((-a)(-a) = (-1)a(-1)a = a^{2}\).
\end{itemize}
\end{itemize}
\end{enumerate}
\end{itemize}
\section{Negative Elements}
\label{sec:orgf4c529e}
\begin{itemize}
\item \(\mathbb{D}\) \(P=\{x\in F | x>0\}\) the positive elements of F. Then, \(-P = \{-x | x \in P\} = \{x \in F | x < 0\}\).
\item Claim: \(F = P \cup \{0\} \cup -P\). In other words, F can be written as a disjoint union and P, the set of all positive elements of F, is closed under \(+\) and \(\cdot\).\\[0pt]
Proof:
\begin{enumerate}
\item P is closed under addition, i.e. \(a >0, b>0 \Rightarrow a+b > 0\)\\[0pt]
\(a > 0 \Rightarrow a+b > 0 + b\) \\[0pt]
and \(b > 0 \Rightarrow 0 + b > 0 + 0\)\\[0pt]
\(\Rightarrow a+b > 0\)\\[0pt]
Thus, P is closed under addition.
\item P is closed under multiplication. According to the second property of the \(\mathbb{D}\) of compatibility, it is closed.
\end{enumerate}
\item THM: (No Order) Let \(F = P \cup \{0\} \cup -P\) be a disjoint union in which P is closed under ``\(+\)'' and ``\(\cdot\)''. \\[0pt]
Then, the rule, \(a > b := a-b\in P\), defines a compatible total (strict) order on F.
\begin{itemize}
\item Proof: We must show > satisfies trichotomy, transitivity, and the compatibility. Note: trichotomy + transitivity \(\equiv\) totality!
\begin{enumerate}
\item Trichotomy:\\[0pt]
let \(a, b \in F\), then \(a -b \in P \cup\{0\}\cup -P\)\\[0pt]
\(a-b\in P \Rightarrow a >b\)\\[0pt]
\(a-b \in \{0\} \Rightarrow a = b\)\\[0pt]
\(a- b \in -P \Rightarrow a < b\)\\[0pt]
Thus, trichotomy is satisfied.
\item Transitivity:\\[0pt]
\(a > b, b > c \Rightarrow a-b, b-c \in P\)\\[0pt]
Then, the summation \((a-b) + (b-c) = a-c \in P\) since \(P\) is closed under addition.
Thus \(a-c\in P \Rightarrow a > c\), i.e. transitivity is satisfied.
\item Compatibility:\\[0pt]
Coming next lecture!
\end{enumerate}
\end{itemize}
\end{itemize}
\section{Disjoint Union}
\label{sec:org57c2fdd}
\begin{itemize}
\item \(\mathbb{D}\) Formally, let \(\{A_{i}:i\in I\}\) be a family of sets indexed by \(I\). The \textbf{disjoint union} is of this family is the set \(\underset{{i\in I}}\bigsqcup A_{i} = \underset{{i\in I}}\bigcup\{(x, i): x\in A_{i}\}\).
\item \(\mathbb{M}\) In this disjoint set, all elements have the format as \((x, i)\). Therefore, this union is generated to be disjoint since even if \(A_{i}\) and \(A_{j}\) are not disjoint, the index element will make the resultant element disjoint.
\end{itemize}
\end{document}